; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-52)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on b7 b5)
    (on b5 b9)
    (on b9 b13)
    (on b13 b11)
    (on b11 b1)
    (on b1 b2)
    (on b2 b14)
    (on b14 b12)
    (on b12 b4)
    (on b4 b15)
    (on b15 b10)
    (on b10 b6)
    (on-table b6)
    (clear b8)
    (on b8 b3)
    (on-table b3))
 (:goal (and 
(on-table b11)
(on-table b14)
(on-table b12)
(on b2 b14)
(on b6 b11)
))
)

; plan
1. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 1 of 5
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 5
3. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 1 of 5
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 5
5. (unstack b9 b13)
   deleted: (on b9 b13) (clear b9) (arm-empty)
   added: (holding b9) (clear b13)
   goals met: 1 of 5
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 5
7. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 1 of 5
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 5
9. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 1 of 5
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 5
11. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 2 of 5
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 5
13. (unstack b2 b14)
   deleted: (on b2 b14) (clear b2) (arm-empty)
   added: (holding b2) (clear b14)
   goals met: 1 of 5
14. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 1 of 5
15. (unstack b14 b12)
   deleted: (on b14 b12) (clear b14) (arm-empty)
   added: (holding b14) (clear b12)
   goals met: 1 of 5
16. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 5
17. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 2 of 5
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 3 of 5
19. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 3 of 5
20. (stack b2 b14)
   deleted: (clear b14) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b14)
   goals met: 4 of 5
21. (unstack b4 b15)
   deleted: (on b4 b15) (clear b4) (arm-empty)
   added: (holding b4) (clear b15)
   goals met: 4 of 5
22. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 5
23. (unstack b15 b10)
   deleted: (on b15 b10) (clear b15) (arm-empty)
   added: (holding b15) (clear b10)
   goals met: 4 of 5
24. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 5
25. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 4 of 5
26. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 4 of 5
27. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 4 of 5
28. (stack b6 b11)
   deleted: (clear b11) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b11)
   goals met: 5 of 5
